Autodesk.Revit.DB.CompoundStructure.AssociateRegionWithLayer(System.Int32,System.Int32)
Associates a region with a layer.
regionId:
The id of a region.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid region id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.GetRegionsAssociatedToLayer(System.Int32)
Gets the set of region ids associated to a particular layer.
Remarks:
Regions are associated to layers. In a vertically compound structure, more than one region may be associated to a
single layer.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
An array of region ids which are associated to the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.IsLayerValid(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Verifies that the data in this layer is internally consistent.
Remarks:
If the layer function is not Membrane or StructuralDeck, the width must be greater than zero.
If the layer function is not StructuralDeck, then the deck embedding type must be Invalid, and the deck profile id must be InvalidElementId.
The priority must be valid to match the function. Refer to Autodesk.Revit.DB.CompoundStructure.IsValidLayerPriority(System.Int32,System.Int32).
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
layer:
The layer to be set.
Returns:
True if the layer is internally consistent, false if the layer is not internally consistent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.IsCoreLayer(System.Int32)
Checks if the specified layer is a core layer.
Remarks:
You can change the shell/core layer boundary using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
Returns true if the layer is within the core layer boundary, false if it is in the interior or exterior shell layers.

Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32)
Sets the number of interior or exterior shell layers.
Remarks:
Changing this value can result in Core layers becoming Shell layers. This can also result in all Core layers becoming Shell layers and there being an empty core.
shellLayerType:
If ShellLayerType.Exterior set the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type).
If ShellLayerType.Interior set the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).
numLayers:
The number of layers to be in the specified shell.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Number of shell layers is negative.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Too many shell layers: Number of shell layers of this type is too large.

Autodesk.Revit.DB.CompoundStructure.GetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType)
Retrieves the number of interior or exterior shell layers.
Remarks:
There could be no core layers. You can change the shell/core layer boundary using Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
shellLayerType:
If ShellLayerType.Exterior return the number of exterior shell layers (or top shell layers for a roof, floor, or ceiling type).
If ShellLayerType.Interior return the number of interior shell layers (or bottom shell layers for a roof, floor, or ceiling type).
Returns:
The number of shell layers in the interior or exterior shell, as specified by shellLayerType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.SetParticipatesInWrapping(System.Int32,System.Boolean)
Assigns if a layer is included in wrapping at inserts and ends.
Remarks:
This method applies only to interior and exterior shell layers.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
participatesInWrapping:
True if the specified layer will participate in wrapping at inserts and ends, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wrapping of the layer is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.ParticipatesInWrapping(System.Int32)
Identifies if a layer is included in wrapping at inserts and ends.
Remarks:
This method applies only to interior and exterior shell layers.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
If true, then the layer participates in wrapping at inserts and openings. If false, the layer will not
participate in wrapping.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetLayer(System.Int32,Autodesk.Revit.DB.CompoundStructureLayer)
Sets a single layer for this CompoundStructure.
Remarks:
This function does not support addition of new layers, use SetLayers() to change the number of layers.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
layer:
The layer to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not valid for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation is valid only for non-vertically compound structures.

Autodesk.Revit.DB.CompoundStructure.SetLayers(System.Collections.Generic.IList{Autodesk.Revit.DB.CompoundStructureLayer})
Completely resets this CompoundStructure and applies a new set of layers.
Remarks:
This function will replace all existing layers with the contents of the input.  This provides a full
reset for the CompoundStructure. Therefore:
All layers will be marked as Core layers, and any settings related to Shell layers (such as Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex,
Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex or Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)) will be modified accordingly.Because all layers will be set as Core layers, the value of LayerCapFlag will be ignored (and set to true) automatically.If the layer priority is not set, it will be filled with the default priority by function. The Autodesk.Revit.DB.CompoundStructure.VariableLayerIndex will be unset.The Autodesk.Revit.DB.CompoundStructure.StructuralMaterialIndex will be unset.The compound structure will be set to be vertically homogeneous.
layers:
The layers to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CompoundStructure.SetDeckEmbeddingType(System.Int32,Autodesk.Revit.DB.StructDeckEmbeddingType)
Sets the deck embedding type to use for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
embedType:
The embedding type to be used by the specified layer if it is a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetDeckEmbeddingType(System.Int32)
Retrieves the deck embedding type used for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
The embedding type of the structural deck associated to the specified layer. Invalid if it is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetDeckProfileId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the profile loop to use for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
profileId:
The element id of a FamilySymbol which contains a profile loop to be used by the specified layer if it is a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer is not a structural deck.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetDeckProfileId(System.Int32)
Retrieves the profile loop used for the specified structural deck.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
The element id of a FamilySymbol which contains a profile loop used by a structural deck associated to the specified layer,
or invalidElementId if isStructuralDeck(layerIdx) is false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetLayerPriority(System.Int32)
Retrieves the priority of the specified layer.
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Since:
2026

Autodesk.Revit.DB.CompoundStructure.ResetAllLayersPriorities
Resets all the priorities of all layers to the default priorities defined by their functions.
Since:
2026

Autodesk.Revit.DB.CompoundStructure.ResetLayerPriority(System.Int32)
Resets the priority of the specific layer to the default priority defined by its function.
Remarks:
The default priorities definition:
Structure: 1, Substrate: 2, Thermal/Air Layer: 3, Membrane Layer: 999, Finish 1: 4, Finish 2: 5.
In shell, a non-membrane layer which is closer to the core should not have a lower priority.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Since:
2026

Autodesk.Revit.DB.CompoundStructure.SetLayerPriority(System.Int32,System.Int32)
Sets the priority of the specific layer.
Remarks:
The effective priority value should be between 1-5. Membrane layers should not have a priority, the value should be 999.
You should set the layer priority if you want a customized priority value rather than the default one by function.
In shell, a non-membrane layer which is closer to the core should not have a lower priority.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
priority:
The priority of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The priority of the layer is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Since:
2026

Autodesk.Revit.DB.CompoundStructure.IsValidLayerPriority(System.Int32,System.Int32)
Checks if the layer priority is valid to match the function.
Remarks:
Membrane layers should not have priority, only 999 is allowed.
For layers of other functions, priority value should be between 1 and 5.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
priority:
The priority of the layer to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Since:
2026

Autodesk.Revit.DB.CompoundStructure.SetLayerFunction(System.Int32,Autodesk.Revit.DB.MaterialFunctionAssignment)
Sets the function of the specified layer.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
function:
The function of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructure.GetLayerFunction(System.Int32)
Retrieves the function of the specified layer.
Remarks:
The function determines how this layer interacts with the layers of other elements to which it is joined.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
The function of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.CanLayerWidthBeNonZero(System.Int32)
Identifies if changing the width of an existing layer from zero to a positive value will create a rectangular region.
Remarks:
This is only allowed if there is a vertical line such that all regions to the left are assigned to layers with index < layerIdx,
and all regions to the right are assigned to layers with index > layerIdx.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.

Autodesk.Revit.DB.CompoundStructure.SetLayerWidth(System.Int32,System.Double)
Sets the width of a specified layer.
Remarks:
If the structure is vertically compound, and the layer is associated to a single simple region,
the width of that region is adjusted. If layerIdx is 0 or LayerCount-1,
and there is no associated region in the VerticalRegionsStructure, one will be created and associated to the layer.
If the specified layer index is associated to a simple region, and the width is set to 0.0, that region will be deleted.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
width:
The new width of the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The width of the layer is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the region of the layer is not a simple region.

Autodesk.Revit.DB.CompoundStructure.GetLayerWidth(System.Int32)
Retrieves the width of a specified layer.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
The width of the specified layer.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.GetMaterialId(System.Int32)
Retrieves the material element id of a specified layer.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
The material element id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.SetMaterialId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets a material element for a specified layer.
Remarks:
It is not verified that materialId corresponds to a valid Material element.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
materialId:
The ElementId of a Material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure.DeleteLayer(System.Int32)
Deletes the specified layer from this CompoundStructure.
Remarks:
For a vertically compound structure, a layer
may only be deleted if it is not associated to a region, or else it is associated to exactly one simple
region, which will also be deleted. Regions associated to layers with index greater than layerIdx will
have their associated layer indices decremented by one.
layerIdx:
Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
Returns:
True if the layer was successfully deleted, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The layer cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The layer index is out of range.

Autodesk.Revit.DB.CompoundStructure
Describes the internal structure of a wall, floor, roof or ceiling.
Remarks:
A compound structure consists a collection of ordered layers, proceeding from exterior to interior for a wall, or from top to bottom for a
floor, roof or ceiling. The properties of these layers determine the
thickness, material, function and priority of the overall structure of the associated wall, floor, roof or ceiling.  Layers can
be accessed via the Autodesk.Revit.DB.CompoundStructure.GetLayers method and completely replaced using SetLayers.  Layers
can also be accessed and modified individually using the "layer index", which is a value from in the range [0, LayerCount)
identifying the layer in the structure.
A structure supports the concept of "core layers" and "shell layers".  There are two layer indices which identify
where the boundary between core and shell layers occur in the list of layers.  The boundaries between shell and core layers
are identifiable using
Autodesk.Revit.DB.CompoundStructure.GetFirstCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetLastCoreLayerIndex, Autodesk.Revit.DB.CompoundStructure.GetCoreBoundaryLayerIndex(Autodesk.Revit.DB.ShellLayerType)
or Autodesk.Revit.DB.CompoundStructure.GetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType).  The core layer boundary can be changed with Autodesk.Revit.DB.CompoundStructure.SetNumberOfShellLayers(Autodesk.Revit.DB.ShellLayerType,System.Int32).
Compound structures may be vertically compound.  If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is false,
the CompoundStructure describes a series of parallel layers, each with specified width, function, priority, material and other properties.
If Autodesk.Revit.DB.CompoundStructure.IsVerticallyCompound is true (which should apply only for CompoundStructures assigned to walls) then
horizontal sections at different elevations may have different layered
structures. In this case, the structure describes a vertical section via a rectangle
which is divided into polygonal regions whose sides are all vertical or horizontal segments.
A map associates each of these regions with the index of a layer in the CompoundStructure which
determines the properties of that region.